zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW45Z41083/drivers/romapi/fsl_romapi.c
    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_context_free(context);
}

/*!
 * @brief Verify NBOOT SB3.1 manifest (header message)
 *
 * This function verifies  the NBOOT SB3.1 manifest, initializes the context and loads keys into the
 * CSS key store so that they can be used by nboot_sb3_load_block function
 * The NBOOT context has to be initialized by the function nboot_context_init before calling this function.
 */
nboot_status_t NBOOT_SB3LoaderManifest(nboot_context_t *context, uint32_t *manifest)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(manifest);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_sb3_load_manifest(context, manifest);
}

/*!
 * @brief Verify NBOOT SB3.1 block
 *
 * This function verifies and decrypts an NBOOT SB3.1 block. Decryption is performed in-place.
 * The NBOOT context has to be initialized by the function nboot_context_init before calling this function.
 */
nboot_status_t NBOOT_SB3LoaderBlock(nboot_context_t *context, uint32_t *block)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(block);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_sb3_load_block(context, block);
}

/*!
 * @brief Authenticate and load Sentinel200 firmware at once
 *
 * This function verifies and decrypts SB3.1 file with S200 firmware. Decryption is performed to S200 RAM and firmware
 * automaticly started after sucessfull load. The NBOOT context has to be initialized by the function nboot_context_init
 * before calling this function.
 */
nboot_status_t NBOOT_SB3LoaderS200Fw(nboot_context_t *context, uint32_t *sb3Data)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(sb3Data);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_sb3_load_s200_fw(context, sb3Data);
}

/*!
 * @brief Secure boot image authentication
 *
 * This function authenticates image with asymmetric cryptography.
 */
nboot_status_t NBOOT_ImgAuthenticateEcdsa(nboot_context_t *context,
                                          uint8_t imageStart[],
                                          nboot_bool_t *isSignatureVerified)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(isSignatureVerified);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_img_authenticate_ecdsa(context, imageStart,
                                                                                        isSignatureVerified);
}

/*!
 * @brief Get random number in the highest quality, which is currently avaibale, no delay with TRNG initialization.
 */
nboot_status_t NBOOT_RngRandom(nboot_context_t *context, void *buf, size_t bufLen)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(buf);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_rng_random(context, buf, bufLen);
}

/*!
 * @brief Get high quality random number(s)
 */
nboot_status_t NBOOT_RngRandomHq(nboot_context_t *context, void *buf, size_t bufLen)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(buf);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_rng_random_hq(context, buf, bufLen);
}

/*!
 * @brief Program a fuse word
 * Programs a fuse word at given address with new data.
 */
nboot_status_t NBOOT_FuseProgram(nboot_context_t *context,
                                 uint32_t addr,
                                 uint32_t *data,
                                 uint32_t systemClockFrequencyMHz)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(data);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_fuse_program(context, addr, data,
                                                                              systemClockFrequencyMHz);
}

/*!
 * @brief Reads a fuse word
 * Reads a fuse word.
 */
nboot_status_t NBOOT_FuseRead(nboot_context_t *context, uint32_t addr, uint32_t *data, uint32_t systemClockFrequencyMHz)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(data);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_fuse_read(context, addr, data,
                                                                           systemClockFrequencyMHz);
}

/*!
 * @brief Read property
 * One of the important properties that can be read is the property that last
 * authentication of signed image container has succeeded.
 */
nboot_status_t NBOOT_PropertyGet(nboot_context_t *context, uint32_t propertyId, uint8_t *destData, size_t *dataLen)
{
    assert(BOOTLOADER_API_TREE_POINTER);
    assert(context);
    assert(destData);
    assert(dataLen);

    return BOOTLOADER_API_TREE_POINTER->nbootAuthenticate->nboot_property_get(context, propertyId, destData, dataLen);
}
